app/views/blogs/index.html.erb

SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1 AND "favorites"."blog_id" = $2 LIMIT $3  [["user_id", 1], ["blog_id", 1], ["LIMIT", 1]]
---
        <% unless blogs.user_id == current_user.id %>
        <% @favorite = current_user.favorites.find_by(blog_id: blogs.id) %>