app/controllers/blogs_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def update
    @blog = Blog.find(params[:id])
    @user =User.find(current_user.id)