app/controllers/blogs_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def new
    @blog = Blog.new
    @user =User.find(current_user.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def confirm
    @blog = Blog.new(blog_params)
    p "◆◆@blog_confirm◆◆"
    p @blog
    @user =User.find(current_user.id)

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 37], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
INSERT INTO "blogs" ("content", "created_at", "updated_at", "user_id", "image") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "おめシスはいいぞ！おめシスはいいぞ！おめシスはいいぞ！"], ["created_at", "2021-06-04 12:47:09.955346"], ["updated_at", "2021-06-04 12:47:09.955346"], ["user_id", 8], ["image", nil]]
---
  def create
    @blog = current_user.blogs.build(blog_params)
    p "◆◆@blog_create◆◆"
    p @blog
    @user =User.find(current_user.id)
    if params[:back]
      render :new
    else
      if @blog.save(blog_params)

SELECT "blogs".* FROM "blogs"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def index
    p "◆◆blogs_index◆◆"
    @blogs = Blog.all
    @user =User.find(params[:id])

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def edit
    @blog = Blog.find(params[:id])
    @user =User.find(current_user.id)

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "blogs" SET "content" = $1, "updated_at" = $2 WHERE "blogs"."id" = $3  [["content", "おめシスはいいぞ！おめシスはいいぞ！"], ["updated_at", "2021-06-10 14:10:21.875740"], ["id", 2]]
---
  def update
      @blog = Blog.find(params[:id])
      if @blog.update(blog_params)