app/controllers/favorites_controller.rb

  def create
    favorite = current_user.favorites.create(blog_id: params[:blog_id])
---
INSERT INTO "favorites" ("user_id", "blog_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["blog_id", 2], ["created_at", "2021-06-10 11:19:39.263737"], ["updated_at", "2021-06-10 11:19:39.263737"]]

  def destroy
    favorite = current_user.favorites.find_by(id: params[:id]).destroy
---
DELETE FROM "favorites" WHERE "favorites"."id" = $1  [["id", 1]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1 AND "favorites"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]

  def show
    @blog = Blog.new
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]