app/controllers/sessions_controller.rb

  def create
    p "◆◆session_create◆◆"
    user = User.find_by(email: params[:session][:email].downcase)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", ""], ["LIMIT", 1]]