app/controllers/users_controller.rb

  def show
    @blog = Blog.new
    @user =User.find(params[:id])
    @blogs = @user.blogs.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = $1, "image" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["password_digest", "$2a$12$mdEodQkNAkx1ZOObDq3.QuNam3D.PI.10fD.rYuvNFXT.an5kqPhC"], ["image", "top_event346.gif"], ["updated_at", "2021-06-12 12:02:27.922080"], ["id", 1]]